app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Hey"], ["password_digest", "$2a$12$GUDXqiyoS0Fhj6igcGOzROiDqWVFzzyDihl4qw59ct5cqFCultqoi"], ["created_at", "2020-12-03 04:09:55.137407"], ["updated_at", "2020-12-03 04:09:55.137407"]]
---
  def create
    @user = User.create(params.require(:user).permit(:username, :password))